Repository: navigotechsolutions-labs/claude-agent-skills-hub
Catalog: mcp-servers/ai_llm/osaurus/App/osaurus/InfoPlist.xcstrings
Source language: en
Languages: ru, zh_hans, zh_hant

# NSAppleEventsUsageDescription
source: Osaurus uses automation to control other applications on your behalf — including agents that write and run AppleScript to automate tasks on this Mac, and plugins that use automation.
ru: Osaurus использует автоматизацию, чтобы управлять другими приложениями от вашего имени: в том числе агенты могут писать и запускать AppleScript для автоматизации задач на этом Mac, а плагины могут использовать автоматизацию.
zh_hans: Osaurus 插件可能会使用自动化代表你控制其他应用。
zh_hant: Osaurus 插件可能會用自動化來代表你控制其他應用。

# NSCalendarsFullAccessUsageDescription
source: Osaurus plugins may access your calendar to read and create events.
ru: Плагины Osaurus могут получать доступ к календарю, чтобы читать и создавать события.
zh_hans: Osaurus 插件可能会访问你的日历，以读取和创建日程。
zh_hant: Osaurus 插件可能會讀取你的行事曆，用來讀取和建立行事曆。

# NSCalendarsUsageDescription
source: Osaurus plugins may access your calendar to read and create events.
ru: Плагины Osaurus могут получать доступ к календарю, чтобы читать и создавать события.
zh_hans: Osaurus 插件可能会访问你的日历，以读取和创建日程。
zh_hant: Osaurus 插件可能會讀取你的行事曆，用來讀取和建立行事曆。

# NSContactsUsageDescription
source: Osaurus plugins may access your contacts to search and read contact information.
ru: Плагины Osaurus могут получать доступ к контактам, чтобы искать и читать контактную информацию.
zh_hans: Osaurus 插件可能会访问你的联系人，以搜索和读取联系人信息。
zh_hant: Osaurus 插件可能會存取你的聯絡人，以搜尋和讀取聯絡人資訊。

# NSLocalNetworkUsageDescription
source: Osaurus uses the local network to discover and connect to agents running on other devices.
ru: Osaurus использует локальную сеть, чтобы находить агентов на других устройствах и подключаться к ним.
zh_hans: Osaurus 使用本地网络来发现并连接运行在其他设备上的智能体。
zh_hant: Osaurus 使用本地網路來發現並連接執行在其他裝置上的智慧代理。

# NSLocationUsageDescription
source: Osaurus plugins may access your location to provide location-based services.
ru: Плагины Osaurus могут получать доступ к вашей геопозиции, чтобы предоставлять сервисы с учётом местоположения.
zh_hans: Osaurus 插件可能会访问你的位置，以提供基于位置的服务。
zh_hant: Osaurus 插件可能會存取你的位置，以提供基於位置的服務。

# NSLocationWhenInUseUsageDescription
source: Osaurus plugins may access your location to provide location-based services.
ru: Плагины Osaurus могут получать доступ к вашей геопозиции, чтобы предоставлять сервисы с учётом местоположения.
zh_hans: Osaurus 插件可能会访问你的位置，以提供基于位置的服务。
zh_hant: Osaurus 插件可能會存取你的位置，以提供基於位置的服務。

# NSMicrophoneUsageDescription
source: Osaurus uses the microphone for on-device voice transcription with FluidAudio.
ru: Osaurus использует микрофон для локальной расшифровки речи с помощью FluidAudio.
zh_hans: Osaurus 使用麦克风通过 FluidAudio 进行设备端语音转写。
zh_hant: Osaurus 使用麥克風透過 FluidAudio 進行裝置端語音轉寫。

# NSRemindersUsageDescription
source: Osaurus plugins may access your reminders to read and create tasks.
ru: Плагины Osaurus могут получать доступ к напоминаниям, чтобы читать и создавать задачи.
zh_hans: Osaurus 插件可能会访问你的提醒事项，以读取和创建任务。
zh_hant: Osaurus 插件可能會存取你的提醒事項，以讀取和建立任務。

# NSScreenCaptureUsageDescription
source: Osaurus can capture screenshots and system audio only when you grant Screen Recording access.
ru: Osaurus может записывать снимки экрана и системный звук только после предоставления доступа к записи экрана.
zh_hans: 只有在你授予屏幕录制访问权限时，Osaurus 才能捕获屏幕截图和系统音频。
zh_hant: 只有在你授予螢幕錄製存取權限時，Osaurus 才能擷取螢幕截圖和系統音訊。
